# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Mon Apr 06 18:19:47 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design fft_16point

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_im[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {i_data_re[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports i_valid]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports clk]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_im[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {o_data_re[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports o_valid]
set_wire_load_mode "enclosed"
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFHQX1]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFHQX2]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFHQX4]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFHQX8]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFNSRX1]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFNSRX2]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFNSRX4]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFNSRXL]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFQX1]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFQX2]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFQX4]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFQXL]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFRHQX1]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFRHQX2]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFRHQX4]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFRHQX8]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFRX1]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFRX2]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFRX4]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFRXL]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSHQX1]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSHQX2]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSHQX4]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSHQX8]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSRHQX1]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSRHQX2]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSRHQX4]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSRHQX8]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSRX1]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSRX2]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSRX4]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSRXL]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSX1]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSX2]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSX4]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFSXL]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFTRX1]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFTRX2]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFTRX4]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFTRXL]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFX1]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFX2]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFX4]
set_dont_use true [get_lib_cells fast_vdd1v0/SDFFXL]
